In [1]:
import pandas as pd

In [2]:
dic1 = [{'name':'John', 'age':20},{'name':'Tom', 'age':22}]
df1 = pd.DataFrame(dic1)
df1

   age  name
0   20  John
1   22   Tom

In [5]:
dic2 = [{'name':'John', 'phone':'123456'},{'name':'Tom', 'phone':'231654'}]
df2 = pd.DataFrame(dic2)
df2

   name   phone
0  John  123456
1   Tom  231654

In [6]:
df_all = pd.concat([df1, df2], ignore_index=True)
df_all

c:\program files\python36\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    age  name   phone
0  20.0  John     NaN
1  22.0   Tom     NaN
2   NaN  John  123456
3   NaN   Tom  231654

In [7]:
df_all2 = pd.merge(left=df1, right=df2)
df_all2

   age  name   phone
0   20  John  123456
1   22   Tom  231654

In [8]:
dic3 = [{'ten':'John', 'phone':'123456'},{'ten':'Tom', 'phone':'231654'}]
df3 = pd.DataFrame(dic3)
df3

    phone   ten
0  123456  John
1  231654   Tom

In [10]:
df_all3 = pd.merge(left=df1, right=df3, left_on='name', right_on='ten')
df_all3

   age  name   phone   ten
0   20  John  123456  John
1   22   Tom  231654   Tom

In [12]:
dic1 = [{'name':'John', 'age':20, 'phone':'123456'},{'name':'Tom', 'age':22, 'phone':'3456456'},{'name':'Tom', 'age':22, 'phone':'34444555'}]
df1 = pd.DataFrame(dic1)
df1

   age  name     phone
0   20  John    123456
1   22   Tom   3456456
2   22   Tom  34444555

In [14]:
dic2 = [{'name':'John', 'add':'123 NCT'},{'name':'Tom', 'add':'137 NCT'},{'name':'Tom', 'add':'227 NVC'}]
df2 = pd.DataFrame(dic2)
df2

       add  name
0  123 NCT  John
1  137 NCT   Tom
2  227 NVC   Tom

In [15]:
df_all4 = pd.merge(left=df1, right=df2, left_on='name', right_on='name')
df_all4

   age  name     phone      add
0   20  John    123456  123 NCT
1   22   Tom   3456456  137 NCT
2   22   Tom   3456456  227 NVC
3   22   Tom  34444555  137 NCT
4   22   Tom  34444555  227 NVC

In [16]:
df_all4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 4 columns):
age      5 non-null int64
name     5 non-null object
phone    5 non-null object
add      5 non-null object
dtypes: int64(1), object(3)
memory usage: 200.0+ bytes

In [27]:
df_all4['phone'] = df_all4['phone'].astype('i4')

In [28]:
df_all4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 4 columns):
age      5 non-null int64
name     5 non-null object
phone    5 non-null int32
add      5 non-null object
dtypes: int32(1), int64(1), object(2)
memory usage: 180.0+ bytes

In [39]:
dic4 = [{'ten':'John', 'sal':'$12345', 'sex':'F'},{'ten':'Tom', 'sal':'$1654', 'sex':'M'}]
df4 = pd.DataFrame(dic4)
df4

      sal sex   ten
0  $12345   F  John
1   $1654   M   Tom

In [40]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
sal    2 non-null object
sex    2 non-null object
ten    2 non-null object
dtypes: object(3)
memory usage: 128.0+ bytes

In [41]:
df4['sal'] = df4['sal'].str.replace('$','').astype('int')
df4['sex'] = df4['sex'].astype('category')

In [42]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
sal    2 non-null int32
sex    2 non-null category
ten    2 non-null object
dtypes: category(1), int32(1), object(1)
memory usage: 202.0+ bytes

In [44]:
dic5 = [{'ten':'John', 'sal':'$12345', 'sex':'F'},{'ten':'Tom', 'sal':'1654', 'sex':'M'}]
df5 = pd.DataFrame(dic5)
df5

      sal sex   ten
0  $12345   F  John
1    1654   M   Tom

In [47]:
df5['sal'] = pd.to_numeric(df5['sal'], errors='coerce')

In [48]:
df5

      sal sex   ten
0     NaN   F  John
1  1654.0   M   Tom

In [54]:
dic6= [{'ten':'John', 'sal':'$12,345', 'sex':'F'},{'ten':'Tom', 'sal':'1,654', 'sex':'M'}]
df6= pd.DataFrame(dic6)
df6

       sal sex   ten
0  $12,345   F  John
1    1,654   M   Tom

In [52]:
df6['sal'] = df6['sal'].str.replace(',','')
df6['sal'] = df6['sal'].str.replace('$','')
df6['sal'] = df6['sal'].astype('int')

In [56]:
df6['sal'] = df6['sal'].str.replace(',','').str.replace('$','').astype('int')